<template>
  <ion-header>
    <div class="user-agreement-header">
      <div class="user-agreement-header__text">
        Пользовательское соглашение
      </div>
    </div>
  </ion-header>

  <div class="agreement-content">
    <div v-html="agreementContent" />

    <div v-if="error">
      Ошибка на стороне сервера, попробуйте в другое время
    </div>
    <!--    <div class="user-agreement"> -->
    <!--      <h2>ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ ОБ ИСПОЛЬЗОВАНИИ МОБИЛЬНОГО ПРИЛОЖЕНИЯ «DRIFT//THAT»</h2> -->

    <!--      <p><strong>1. Общие положения</strong></p> -->
    <!--      <p> -->
    <!--        <strong>1.1.</strong> Приложение DRIFT//THAT (далее — "Приложение") предоставляется физическим лицом (далее — -->
    <!--        "Разработчик") и предназначено для обмена местоположением между пользователями, увлеченными дрифтом. -->
    <!--      </p> -->
    <!--      <p> -->
    <!--        <strong>1.2.</strong> Настоящее соглашение (далее — "Соглашение") определяет условия использования Приложения. -->
    <!--      </p> -->
    <!--      <p> -->
    <!--        <strong>1.3.</strong> Устанавливая, используя или получая доступ к Приложению, пользователь (далее — -->
    <!--        "Пользователь") соглашается с условиями данного Соглашения. Если Пользователь не согласен с условиями, он должен -->
    <!--        прекратить использование Приложения. -->
    <!--      </p> -->

    <!--      <p><strong>2. Ответственность сторон</strong></p> -->
    <!--      <p> -->
    <!--        <strong>2.1.</strong> Пользователь обязуется соблюдать действующее законодательство Российской Федерации, -->
    <!--        включая правила дорожного движения и законы, регулирующие распространение информации, при использовании -->
    <!--        Приложения. -->
    <!--      </p> -->
    <!--      <p> -->
    <!--        <strong>2.2.</strong> Пользователь соглашается, что использование Приложения осуществляется на его собственный -->
    <!--        риск. -->
    <!--      </p> -->
    <!--      <p> -->
    <!--        <strong>2.3.</strong> Разработчик не несет ответственности за любые инциденты, произошедшие в процессе -->
    <!--        использования Приложения, включая, но не ограничиваясь, авариями, нарушениями правил дорожного движения или -->
    <!--        иными инцидентами. -->
    <!--      </p> -->
    <!--      <p> -->
    <!--        <strong>2.4.</strong> Разработчик не гарантирует точность, безошибочность или бесперебойность работы -->
    <!--        Приложения. -->
    <!--      </p> -->

    <!--      <p><strong>3. Использование местоположения</strong></p> -->
    <!--      <p><strong>3.1.</strong> Приложение использует данные геолокации для отображения местоположения пользователей.</p> -->
    <!--      <p> -->
    <!--        <strong>3.2.</strong> Пользователь соглашается на обработку своих данных местоположения в соответствии с -->
    <!--        Политикой конфиденциальности. -->
    <!--      </p> -->
    <!--      <p> -->
    <!--        <strong>3.3.</strong> Пользователь имеет право в любой момент отключить доступ к данным геолокации в настройках -->
    <!--        устройства. -->
    <!--      </p> -->

    <!--      <p><strong>4. Чат и обмен контентом</strong></p> -->
    <!--      <p> -->
    <!--        <strong>4.1.</strong> В Приложении предусмотрена возможность общения в чате и обмена фотографиями, в -->
    <!--        том числе из галереи устройства или сделанных через камеру. -->
    <!--      </p> -->
    <!--      <p> -->
    <!--        <strong>4.2.</strong> Пользователь обязуется не размещать в чате, а также не передавать другим пользователям -->
    <!--        Приложения: -->
    <!--      </p> -->
    <!--      <ul> -->
    <!--        <li>материал, нарушающий законы Российской Федерации;</li> -->
    <!--        <li>информацию, нарушающую права интеллектуальной собственности;</li> -->
    <!--        <li>клевету, ложные или вводящие в заблуждение сведения;</li> -->
    <!--      </ul> -->
    <!--      <p> -->
    <!--        <strong>4.3.</strong> Все сообщения и контент, размещенные в чате, могут быть удалены в любой момент по -->
    <!--        усмотрению Разработчика, но не позднее чем через 24 часа после их размещения. -->
    <!--      </p> -->

    <!--      <p><strong>5. Ограничение использования</strong></p> -->
    <!--      <p><strong>5.1.</strong> Пользователю запрещается использовать Приложение для:</p> -->
    <!--      <ul> -->
    <!--        <li>нарушения правил дорожного движения;</li> -->
    <!--        <li>совершения действий, которые могут представлять угрозу жизни, здоровью или имуществу других лиц;</li> -->
    <!--      </ul> -->

    <!--      <p><strong>6. Изменения в Соглашении</strong></p> -->
    <!--      <p> -->
    <!--        <strong>6.1.</strong> Разработчик оставляет за собой право вносить изменения в настоящее Соглашение без -->
    <!--        предварительного уведомления Пользователей. -->
    <!--      </p> -->
    <!--      <p><strong>6.2.</strong> Обновленные условия вступают в силу с момента их публикации в Приложении.</p> -->

    <!--      <p><strong>7. Политика конфиденциальности</strong></p> -->
    <!--      <p> -->
    <!--        <strong>7.1.</strong> Приложение собирает и обрабатывает минимально необходимые данные, включая данные -->
    <!--        геолокации, исключительно для выполнения функций Приложения. -->
    <!--      </p> -->
    <!--      <p> -->
    <!--        <strong>7.2.</strong> Данные не передаются третьим лицам, за исключением случаев, предусмотренных -->
    <!--        законодательством Российской Федерации. -->
    <!--      </p> -->

    <!--      <p><strong>8. Отказ от ответственности</strong></p> -->
    <!--      <p> -->
    <!--        <strong>8.1.</strong> Разработчик предоставляет Приложение "как есть" (as-is) и не несет ответственности за -->
    <!--        любые убытки, прямые или косвенные, возникшие в результате использования Приложения. -->
    <!--      </p> -->
    <!--      <p><strong>9. Заключительные положения</strong></p> -->
    <!--      <p><strong>9.1.</strong> Настоящее Соглашение регулируется законодательством Российской Федерации.</p> -->
    <!--      <p><strong>9.2.</strong> В случае возникновения споров стороны обязуются предпринять все усилия для их урегулирования путем переговоров.</p> -->
    <!--      <p><strong>9.3.</strong> В случае невозможности урегулирования спора путем переговоров, спор подлежит рассмотрению в суде по месту нахождения Разработчика.</p> -->
    <!--    </div> -->
    <ion-button v-if="!error && !menu.acceptAgreement" expand="full" color="secondary" @click="menu.acceptAgreement = true">
      Принять
    </ion-button>
  </div>

  <ion-button v-if="menu.acceptAgreement" expand="full" color="secondary" @click="$emit('close')">
    Закрыть
  </ion-button>
</template>

<script setup lang="ts">
defineEmits(['close'])

const { menu } = useMenu()

const { data: agreementContent, error } = await useAsyncData('agreement', () =>
  $fetch('https://drift-that.ru/agreement', {
    method: 'GET',
  }))
</script>

<style lang="scss">
.agreement-content {
  padding: 20px;
  height: 100%;
  font-size: 14px;
  line-height: 1.6;
  color: #333;
  background-color: #f9f9f9;
  overflow: auto;

  h2 {
    font-size: 18px;
    font-weight: bold;
    margin-bottom: 16px;
  }

  p {
    margin-bottom: 8px;
  }

  ul {
    list-style-type: disc; /* Используем стандартные маркеры (кружочки) */
    margin-left: 20px; /* Отступ слева для списка */
    padding-left: 10px; /* Добавляем отступ внутри списка */
  }

  li {
    font-size: 14px;
    margin-bottom: 8px; /* Отступ между пунктами списка */
    //color: #555; /* Цвет текста для пунктов */
  }
}

ion-button {
  margin-top: 12px;
}

.user-agreement-header {
  display: flex;
  align-items: center;
  justify-content: center;

  background-color: $background;
  height: 60px;

  &__text {
    font-weight: 700;
    font-size: 16px;
    //display: flex;
    //align-items: center;
    //justify-content: center;
  }
}
</style>
